saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.MKE15Z7_DFP.11.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux" Cversion="2.0.2" condition="device.MKE15Z7_AND_driver.common">
      <description>DMAMUX Driver</description>
      <files>
        <file category="header" name="drivers/fsl_dmamux.h"/>
        <file category="sourceC" name="drivers/fsl_dmamux.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="crc" Cversion="2.0.1" condition="device.MKE15Z7_AND_driver.common">
      <description>CRC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_crc.c"/>
        <file category="header" name="drivers/fsl_crc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.0.2" condition="device.MKE15Z7_AND_driver.common">
      <description>ADC12 Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_adc12.c"/>
        <file category="header" name="drivers/fsl_adc12.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="acmp" Cversion="2.0.4" condition="device.MKE15Z7_AND_driver.common">
      <description>ACMP Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_acmp.c"/>
        <file category="header" name="drivers/fsl_acmp.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.0" condition="device.MKE15Z7_AND_driver.common">
      <description>Clock Driver</description>
      <files>
        <file category="header" name="drivers/fsl_clock.h"/>
        <file category="sourceC" name="drivers/fsl_clock.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.0.1" condition="device.MKE15Z7_AND_device.MKE15Z7_CMSIS_AND_driver.clock">
      <description>COMMON Driver</description>
      <files>
        <file category="header" name="drivers/fsl_common.h"/>
        <file category="sourceC" name="drivers/fsl_common.c"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MKE15Z7" Cversion="1.0.0" condition="device.MKE15Z7_AND_component.lpuart_adapter_AND_component.serial_manager_uart_AND_device.MKE15Z7_startup_AND_driver.adc12_AND_driver.clock_AND_driver.common_AND_driver.gpio_AND_driver.lpi2c_AND_driver.lpuart_AND_driver.port_AND_driver.smc_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="MKE15Z7_startup" Cversion="1.0.0" condition="device.MKE15Z7_AND_CMSIS_Include_core_cm0plus">
      <description/>
      <files>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_MKE15Z7.s"/>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_MKE15Z7.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKE15Z128xxx7_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKE15Z128xxx7_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKE15Z256xxx7_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKE15Z256xxx7_ram.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKE15Z128xxx7_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKE15Z128xxx7_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKE15Z256xxx7_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKE15Z256xxx7_ram.icf"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="header" attr="config" name="MKE15Z7.h"/>
        <file category="header" attr="config" name="MKE15Z7_features.h"/>
        <file category="sourceC" attr="config" name="system_MKE15Z7.c"/>
        <file category="header" attr="config" name="system_MKE15Z7.h"/>
      </files>
    </component>
  </components>
</package>
